Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
current1 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
current2 (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
Ftotal (InputLayer)             [(None, 1)]          0                                            
__________________________________________________________________________________________________
velocity (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 1)            0           current1[0][0]                   
__________________________________________________________________________________________________
tf.convert_to_tensor_1 (TFOpLam (None, 1)            0           current2[0][0]                   
__________________________________________________________________________________________________
tf.convert_to_tensor_2 (TFOpLam (None, 1)            0           Ftotal[0][0]                     
__________________________________________________________________________________________________
tf.convert_to_tensor_3 (TFOpLam (None, 1)            0           velocity[0][0]                   
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (None, 1)            0           tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (None, 1)            0           tf.convert_to_tensor_1[0][0]     
__________________________________________________________________________________________________
tf.math.subtract_2 (TFOpLambda) (None, 1)            0           tf.convert_to_tensor_2[0][0]     
__________________________________________________________________________________________________
tf.math.subtract_3 (TFOpLambda) (None, 1)            0           tf.convert_to_tensor_3[0][0]     
__________________________________________________________________________________________________
tf.math.truediv (TFOpLambda)    (None, 1)            0           tf.math.subtract[0][0]           
__________________________________________________________________________________________________
tf.math.truediv_1 (TFOpLambda)  (None, 1)            0           tf.math.subtract_1[0][0]         
__________________________________________________________________________________________________
tf.math.truediv_2 (TFOpLambda)  (None, 1)            0           tf.math.subtract_2[0][0]         
__________________________________________________________________________________________________
tf.math.truediv_3 (TFOpLambda)  (None, 1)            0           tf.math.subtract_3[0][0]         
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 4)            0           tf.math.truediv[0][0]            
                                                                 tf.math.truediv_1[0][0]          
                                                                 tf.math.truediv_2[0][0]          
                                                                 tf.math.truediv_3[0][0]          
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           160         concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 32)           0           dense[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            33          dropout[0][0]                    
==================================================================================================
Total params: 193
Trainable params: 193
Non-trainable params: 0
__________________________________________________________________________________________________
